12/data/attachments/b1b13ec33c9c63c2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d576d136-7db5-41f1-bde4-2b4e07f990f4</nif:username>
            <nif:friendToBeAdded>Wayne_future_Friend_57344_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>